# RemoveTrussSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..RemoveTrussSketch Property
BuiltInFailures..::..TrussFailures Class See Also
---
Remove Sketch
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemoveTrussSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemoveTrussSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemoveTrussSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace